---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotLinkAnnotationsForSomeViews
source: html/bef7e803-500a-5125-8b0e-a6f6369b4110.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotLinkAnnotationsForSomeViews Property

Annotations for some views cannot be displayed from linked file.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotLinkAnnotationsForSomeViews { get; }
```